**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [3]:
import pandas as pd
import numpy as np

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [4]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i','j']
Birds = pd.DataFrame(data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']})


#Birds.index = labels   # need to keep labels at the index 
Birds

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [5]:
print(Birds)
print(Birds.columns)
print(Birds.shape)

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no
Index(['birds', 'age', 'visits', 'priority'], dtype='object')
(10, 4)

**3. Print the first 2 rows of the birds dataframe**

In [6]:
#Birds[0:2] # 
Birds.head(2)

    birds  age  visits priority
0  Cranes  3.5       2      yes
1  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [20]:
#Birds[['birds','age']]


Birds.loc[:,['birds','age']]

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [21]:
b = Birds.iloc[[2,3,7]]
b[['birds', 'age', 'visits']]
#b.loc[:,['birds', 'age', 'visits']]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [7]:
#Birds[['birds','age','priority']][Birds['visits'] < 4] 
#Birds.loc[Birds['visits'] < 4]
Birds.loc[:,['birds','age','priority']][Birds['visits'] < 4]

        birds  age priority
0      Cranes  3.5      yes
2     plovers  1.5       no
4  spoonbills  6.0       no
6     plovers  5.5       no
7      Cranes  NaN      yes
8  spoonbills  8.0       no
9  spoonbills  4.0       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [23]:
Birds[['birds','visits']][Birds['age'].isnull()]
#Birds.loc[:,['birds','visits']][Birds['age'].isnull()]

        birds  visits
3  spoonbills       4
7      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [24]:
Birds[(Birds['birds'] == 'Cranes') & (Birds['age'] < 4) ]

    birds  age  visits priority
0  Cranes  3.5       2      yes
5  Cranes  3.0       4       no

In [25]:
#Birds[Birds['age'] < 4][Birds['birds'] =='Cranes' ]

#Birds[Birds['birds'] == 'Cranes'] [Birds['age'] < 4]

Birds[(Birds['birds'] == 'Cranes') & (Birds['age'] < 4)]

    birds  age  visits priority
0  Cranes  3.5       2      yes
5  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [26]:
Birds[(Birds['age'] > 2) & (Birds['age'] <= 4)]

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
9  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [27]:
c = Birds[Birds['birds']=='Cranes']
c['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [28]:
g = Birds.groupby('birds')
print(g)
for birds,birds_df in g:
    #print(birds)
    #print(birds_df)
    print('Mean of age for {} is {}'.format(birds,birds_df['age'].mean()))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000263C26B3A90>
Mean of age for Cranes is 3.5
Mean of age for plovers is 3.5
Mean of age for spoonbills is 6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [29]:
data = [{'birds':'Khukhaboora','age':2,'visits':4,'priority':'yes'}]
df = pd.DataFrame(data,index = ['k'])
df
#df = pd.DataFrame(data) # can be done as in the beginning
#df.index = ['k']
new = pd.concat([Birds,df],axis=0)
new

Birds = new.drop(['k'])
Birds

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [30]:
Birds['birds'].value_counts()

spoonbills    4
Cranes        4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [31]:
print(Birds)
print('***********')
desc_age = Birds.sort_values('age',ascending=False)
print(desc_age)
print('***********')
asc_visits = desc_age.sort_values('visits',ascending = True)
print(asc_visits)

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no
***********
        birds  age  visits priority
8  spoonbills  8.0       3       no
4  spoonbills  6.0       3       no
6     plovers  5.5       2       no
1      Cranes  4.0       4      yes
9  spoonbills  4.0       2       no
0      Cranes  3.5       2      yes
5      Cranes  3.0       4       no
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
7      Cranes  NaN       2      yes
***********
        birds  age  visits priority
6     plovers  5.5       2       no
9  spoonbills  4.0       2       no
0      Cranes  3.5       2      yes
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
4  spoonbills  6.0       3       no
2     plovers  1.5       3       no
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
3  spoonbills  NaN       4      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [32]:
Bin_priority = Birds['priority'].replace({'yes':1,'no':0})
Bin_priority

0    1
1    1
2    0
3    1
4    0
5    0
6    0
7    1
8    0
9    0
Name: priority, dtype: int64

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [33]:
Birds['birds'].replace('Cranes','trumpeters')

0    trumpeters
1    trumpeters
2       plovers
3    spoonbills
4    spoonbills
5    trumpeters
6       plovers
7    trumpeters
8    spoonbills
9    spoonbills
Name: birds, dtype: object

In [34]:
#Birds = Birds['age'].fillna(0)
#print(Birds)

In [35]:
Birds = Birds['age'].replace(np.nan, 0)
print(Birds)

0    3.5
1    4.0
2    1.5
3    0.0
4    6.0
5    3.0
6    5.5
7    0.0
8    8.0
9    4.0
Name: age, dtype: float64